{
    "information technology": "Analyze the Information Technology sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Impact: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% influence IT sector growth and innovation. 2. Stock Performance: Highlight financial metrics for key players like {stockOverview}, discussing what these indicate about the sector’s financial health and investor confidence. 3. Risks: Identify 3–5 risks (e.g., regulatory scrutiny, geopolitical tensions, cybersecurity threats) facing the IT sector through 2030, analyzing their potential impact. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI, quantum computing, cloud adoption) driving IT growth, supported by market trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past tech cycles (e.g., dot-com bubble, mobile revolution), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., overvaluation, regulatory crackdowns) and a bull thesis (e.g., innovation, digital transformation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., rapid innovation cycles, data privacy regulations) distinguishing IT from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Apple, Microsoft), focusing on innovation and market position. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., AI adoption, IoT expansion) and barriers (e.g., regulation, competition).",
    "semiconductors": "Analyze the semiconductor industry in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact semiconductor demand and production costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market sentiment. 3. Risks: Identify 3–5 risks (e.g., geopolitical tensions in Taiwan, supply chain disruptions, U.S.-China trade restrictions) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI chip demand, 3nm technology, automotive applications) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past semiconductor cycles (e.g., 2000s chip shortages, 2010s mobile boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, geopolitical risks) and a bull thesis (e.g., AI and EV demand, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., reliance on Taiwan, high R&D costs) distinguishing semiconductors from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., TSMC, NVIDIA), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., AI, IoT) and barriers (e.g., supply chain risks, regulation).",
    "software-as-a-service (saas)": "Analyze the SaaS sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% affect SaaS adoption and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health. 3. Risks: Identify 3–5 risks (e.g., customer churn, data breaches, regulatory compliance) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI integration, enterprise digital transformation, vertical SaaS) driving growth. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past SaaS cycles (e.g., post-2008 cloud adoption, 2020s remote work boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., high valuations, competition) and a bull thesis (e.g., recurring revenue, scalability) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., subscription model, data privacy laws) distinguishing SaaS from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Salesforce, Microsoft), focusing on market dominance and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., AI, global expansion) and barriers (e.g., saturation, regulation).",
    "cybersecurity": "Analyze the cybersecurity sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact cybersecurity spending and innovation. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and growth. 3. Risks: Identify 3–5 risks (e.g., AI-driven attacks, regulatory fines, talent shortages) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., cloud security, zero-trust adoption, IoT protection) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past cybersecurity cycles (e.g., 2010s data breach surge, 2020s ransomware boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., market saturation, commoditization) and a bull thesis (e.g., rising cyber threats, regulatory demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., evolving threats, government mandates) distinguishing cybersecurity from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Palo Alto Networks, CrowdStrike), focusing on innovation and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., digital transformation, cybercrime) and barriers (e.g., competition, regulation).",
    "cloud computing": "Analyze the cloud computing sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% affect cloud adoption and infrastructure investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., security breaches, regulatory compliance, vendor lock-in) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., hybrid cloud, edge computing, AI workloads) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past cloud cycles (e.g., 2010s cloud migration, 2020s remote work surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., margin compression, competition) and a bull thesis (e.g., scalability, enterprise adoption) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., infrastructure dependency, data sovereignty laws) distinguishing cloud computing from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., AWS, Azure), focusing on market share and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., AI, IoT) and barriers (e.g., security risks, regulation).",
    "artificial intelligence (ai)": "Analyze the AI sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact AI investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and growth. 3. Risks: Identify 3–5 risks (e.g., ethical concerns, regulatory oversight, talent shortages) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., generative AI, autonomous systems, healthcare applications) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past AI cycles (e.g., 1980s AI winter, 2010s deep learning boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., hype-driven valuations, regulation) and a bull thesis (e.g., transformative applications, scalability) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., compute dependency, ethical debates) distinguishing AI from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., NVIDIA, Google), focusing on hardware/software innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., enterprise adoption, AI hardware) and barriers (e.g., regulation, ethical concerns).",
    "quantum computing": "Analyze the quantum computing sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact quantum computing R&D investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and investor interest. 3. Risks: Identify 3–5 risks (e.g., technological barriers, high R&D costs, cybersecurity threats) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., cryptography, drug discovery, optimization problems) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past quantum computing cycles (e.g., early 2000s hype, 2010s qubit advancements), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., slow commercialization, high costs) and a bull thesis (e.g., breakthrough applications, government support) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., quantum supremacy race, extreme R&D timelines) distinguishing quantum computing from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., IBM, Google), focusing on qubit technology and research partnerships. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., government funding, enterprise adoption) and barriers (e.g., scalability, costs).",
    "blockchain technology": "Analyze the blockchain technology sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact blockchain adoption and investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market sentiment. 3. Risks: Identify 3–5 risks (e.g., regulatory crackdowns, scalability issues, energy consumption) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., supply chain transparency, DeFi, enterprise adoption) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past blockchain cycles (e.g., 2017 crypto boom, 2021 DeFi surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulatory bans, market saturation) and a bull thesis (e.g., enterprise adoption, Web3 growth) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., decentralization, regulatory uncertainty) distinguishing blockchain from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Coinbase, Ethereum ecosystem), focusing on adoption and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., DeFi, NFT expansion) and barriers (e.g., regulation, scalability).",
    "fintech": "Analyze the fintech sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact fintech innovation and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and growth. 3. Risks: Identify 3–5 risks (e.g., regulatory scrutiny, cybersecurity threats, market saturation) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., digital wallets, blockchain payments, financial inclusion) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past fintech cycles (e.g., 2010s mobile payments boom, 2020s crypto surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulatory crackdowns, competition) and a bull thesis (e.g., digital transformation, emerging markets) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., regulatory complexity, rapid innovation) distinguishing fintech from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., PayPal, Square), focusing on market reach and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., digital payments, DeFi) and barriers (e.g., regulation, competition).",
    "data centers": "Analyze the data center sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact data center investment and expansion. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., energy costs, environmental regulations, cybersecurity threats) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., cloud growth, edge computing, AI workloads) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past data center cycles (e.g., 2010s cloud boom, 2020s remote work surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., high energy costs, regulatory scrutiny) and a bull thesis (e.g., digital transformation, AI demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., energy consumption, real estate dependency) distinguishing data centers from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Equinix, Digital Realty), focusing on infrastructure and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., cloud adoption, IoT) and barriers (e.g., sustainability concerns, costs).",
    "healthcare": "Analyze the healthcare sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact healthcare spending and innovation. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory changes, drug pricing reforms, patent cliffs) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI diagnostics, personalized medicine, telehealth) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past healthcare cycles (e.g., 1990s biotech boom, 2020s mRNA vaccine surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulatory crackdowns, cost pressures) and a bull thesis (e.g., innovation, aging population) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., regulatory complexity, high R&D costs) distinguishing healthcare from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Pfizer, Johnson & Johnson), focusing on innovation and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., biotech breakthroughs, global health demand) and barriers (e.g., regulation, pricing pressures).",
    "pharmaceuticals": "Analyze the pharmaceutical sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact pharmaceutical R&D and pricing. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., patent expirations, drug pricing regulations, R&D failures) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., biologics, rare disease treatments, global expansion) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past pharmaceutical cycles (e.g., 1990s blockbuster drug era, 2020s mRNA boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., pricing pressures, generic competition) and a bull thesis (e.g., innovation, aging population) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., regulatory approval timelines, patent cliffs) distinguishing pharmaceuticals from other healthcare sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Pfizer, Merck), focusing on drug pipelines and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., new drug classes, emerging markets) and barriers (e.g., regulation, competition).",
    "biotech": "Analyze the biotech sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact biotech R&D and funding. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and investor interest. 3. Risks: Identify 3–5 risks (e.g., clinical trial failures, regulatory hurdles, funding volatility) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., gene therapies, mRNA technology, AI drug discovery) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past biotech cycles (e.g., 1990s genomics boom, 2020s mRNA vaccine surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., high R&D costs, regulatory delays) and a bull thesis (e.g., breakthrough therapies, aging population) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., high R&D risk, regulatory scrutiny) distinguishing biotech from other healthcare sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Amgen, Vertex), focusing on innovation and pipelines. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., personalized medicine, global demand) and barriers (e.g., costs, regulation).",
    "gene editing (crispr)": "Analyze the gene editing (CRISPR) sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact gene editing R&D and funding. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and investor interest. 3. Risks: Identify 3–5 risks (e.g., ethical concerns, regulatory bans, patent disputes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., rare disease treatments, agricultural applications, cancer therapies) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past gene editing cycles (e.g., early 2010s CRISPR discovery, 2020s first therapies), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., ethical backlash, regulatory delays) and a bull thesis (e.g., transformative therapies, global adoption) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., ethical debates, high R&D costs) distinguishing gene editing from other biotech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., CRISPR Therapeutics, Editas), focusing on patents and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., clinical approvals, agriculture) and barriers (e.g., ethics, regulation).",
    "medical devices": "Analyze the medical devices sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact medical device innovation and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory delays, reimbursement challenges, cybersecurity in devices) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI diagnostics, wearable devices, robotic surgery) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past medical device cycles (e.g., 2000s imaging tech boom, 2010s robotics surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulatory hurdles, cost pressures) and a bull thesis (e.g., innovation, aging population) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., regulatory approval timelines, hospital adoption) distinguishing medical devices from other healthcare sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Intuitive Surgical, Medtronic), focusing on innovation and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., AI, aging population) and barriers (e.g., regulation, costs).",
    "telemedicine": "Analyze the telemedicine sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact telemedicine adoption and investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and growth. 3. Risks: Identify 3–5 risks (e.g., regulatory barriers, reimbursement issues, data privacy concerns) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI diagnostics, rural healthcare access, chronic disease management) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past telemedicine cycles (e.g., pre-2020 slow adoption, 2020s pandemic boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulatory hurdles, profitability concerns) and a bull thesis (e.g., digital health demand, scalability) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., reimbursement policies, patient adoption) distinguishing telemedicine from other healthcare sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Teladoc, Amwell), focusing on technology and market reach. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., remote care demand, AI integration) and barriers (e.g., regulation, competition).",
    "energy": "Analyze the energy sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, interest rates at {Interest_Rates}%, and oil prices at ${Oil_Prices} per barrel impact energy demand and investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., geopolitical tensions, decarbonization pressures, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., renewable energy growth, hydrogen adoption, carbon capture) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past energy cycles (e.g., 1970s oil shocks, 2010s shale boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fossil fuel decline, regulatory crackdowns) and a bull thesis (e.g., energy transition innovation, emerging market demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., oil price volatility, ESG pressures) distinguishing energy from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., ExxonMobil, NextEra Energy), focusing on innovation and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., renewables, nuclear revival) and barriers (e.g., regulation, fossil fuel decline).",
    "oil & gas exploration": "Analyze the oil & gas exploration sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, interest rates at {Interest_Rates}%, and oil prices at ${Oil_Prices} per barrel impact exploration activity and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., geopolitical conflicts, decarbonization policies, exploration costs) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., deepwater discoveries, AI seismic imaging, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past exploration cycles (e.g., 2000s deepwater boom, 2014 oil price crash), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., peak oil demand, ESG pressures) and a bull thesis (e.g., untapped reserves, energy demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., oil price sensitivity, geopolitical risks) distinguishing oil & gas exploration from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Schlumberger, EOG Resources), focusing on technology and exploration success. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., emerging market demand, technology) and barriers (e.g., regulation, renewables shift).",
    "oil refining & marketing": "Analyze the oil refining & marketing sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, interest rates at {Interest_Rates}%, and oil prices at ${Oil_Prices} per barrel impact refining margins and marketing strategies. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., low-carbon mandates, supply disruptions, refining overcapacity) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., biofuel production, emerging market demand, operational efficiency) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past refining cycles (e.g., 2000s refining boom, 2014 oil price crash), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., decarbonization, overcapacity) and a bull thesis (e.g., emerging market demand, efficiency gains) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., crack spreads, environmental regulations) distinguishing refining & marketing from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Valero, Phillips 66), focusing on operational efficiency and market reach. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., biofuels, efficiency) and barriers (e.g., regulation, renewables shift).",
    "natural gas": "Analyze the natural gas sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, interest rates at {Interest_Rates}%, and oil prices at ${Oil_Prices} per barrel impact natural gas demand and pricing. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., price volatility, decarbonization policies, geopolitical supply disruptions) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., LNG exports, industrial demand, bridge fuel role) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past natural gas cycles (e.g., 2000s shale boom, 2010s LNG surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., renewables competition, regulatory crackdowns) and a bull thesis (e.g., LNG growth, energy transition role) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., price volatility, LNG infrastructure) distinguishing natural gas from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Chesapeake Energy, Range Resources), focusing on production and market reach. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., LNG, industrial demand) and barriers (e.g., regulation, renewables).",
    "offshore drilling": "Analyze the offshore drilling sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, interest rates at {Interest_Rates}%, and oil prices at ${Oil_Prices} per barrel impact offshore drilling activity and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., oil price volatility, environmental regulations, rig supply shortages) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., deepwater exploration, technological efficiency, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past offshore drilling cycles (e.g., 2000s deepwater boom, 2014 oil price crash), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., decarbonization, regulatory crackdowns) and a bull thesis (e.g., untapped reserves, energy demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., oil price sensitivity, harsh operational environments) distinguishing offshore drilling from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Transocean, Noble Corporation), focusing on rig technology and global reach. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., deepwater projects, efficiency) and barriers (e.g., regulation, renewables shift).",
    "nuclear energy": "Analyze the nuclear energy sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact nuclear energy investment and expansion. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., public perception, regulatory delays, uranium supply constraints) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., small modular reactors, carbon-free energy demand, government support) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past nuclear cycles (e.g., 1980s nuclear decline, 2010s revival), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., safety concerns, high costs) and a bull thesis (e.g., climate goals, government funding) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., public perception, long project timelines) distinguishing nuclear energy from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Cameco, NexGen Energy), focusing on uranium supply and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., SMRs, climate policies) and barriers (e.g., regulation, costs).",
    "renewable energy": "Analyze the renewable energy sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact renewable energy investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., intermittency challenges, policy uncertainty, supply chain issues) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., solar/wind cost declines, energy storage, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past renewable cycles (e.g., 2000s solar boom, 2010s wind surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., grid integration issues, subsidy reliance) and a bull thesis (e.g., climate goals, cost declines) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., intermittency, government incentives) distinguishing renewable energy from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., First Solar, Vestas), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., energy storage, global demand) and barriers (e.g., grid challenges, costs).",
    "hydrogen fuel cells": "Analyze the hydrogen fuel cell sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Evaluate how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact hydrogen fuel cell investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, analyzing what these reveal about the sector’s financial stability and market position. 3. Risks: Identify 3–5 risks (e.g., high production costs, infrastructure gaps, competition from batteries) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., heavy transport, industrial decarbonization, government subsidies) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past hydrogen cycles (e.g., early 2000s hype, 2020s policy push), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., slow infrastructure buildout, cost barriers) and a bull thesis (e.g., climate goals, industrial demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., hydrogen production costs, infrastructure needs) distinguishing hydrogen fuel cells from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Plug Power, Ballard), focusing on technology and market applications. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., policy support, transport demand) and barriers (e.g., costs, infrastructure).",
    "solar power": "Analyze the solar power sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact solar power investment and deployment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., intermittency, supply chain disruptions, policy shifts) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., cost declines, energy storage integration, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past solar cycles (e.g., 2000s solar boom, 2010s cost decline), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., grid challenges, subsidy cuts) and a bull thesis (e.g., climate goals, scalability) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., intermittency, land use) distinguishing solar power from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., First Solar, Sunrun), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., storage, global adoption) and barriers (e.g., grid integration, costs).",
    "wind energy": "Analyze the wind energy sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact wind energy investment and expansion. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., intermittency, supply chain issues, regulatory uncertainty) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., offshore wind, turbine efficiency, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past wind cycles (e.g., 2000s onshore boom, 2010s offshore surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., grid integration, subsidy reliance) and a bull thesis (e.g., climate goals, offshore growth) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., intermittency, turbine scale) distinguishing wind energy from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Vestas, Siemens Gamesa), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., offshore wind, global demand) and barriers (e.g., grid challenges, costs).",
    "financials": "Analyze the financials sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact financial sector profitability and lending. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory changes, economic downturns, cybersecurity threats) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., fintech integration, emerging market growth, sustainable finance) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past financial cycles (e.g., 2008 financial crisis, 2010s recovery), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rising defaults, regulatory crackdowns) and a bull thesis (e.g., digital transformation, rate hikes) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., interest rate sensitivity, regulatory oversight) distinguishing financials from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., JPMorgan Chase, Visa), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., fintech, global expansion) and barriers (e.g., regulation, competition).",
    "investment banks": "Analyze the investment banks sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact investment banking activity and deal flow. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., market volatility, regulatory scrutiny, geopolitical tensions) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., M&A growth, sustainable finance, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past investment banking cycles (e.g., 2008 crisis, 2010s IPO boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., economic slowdown, regulatory crackdowns) and a bull thesis (e.g., deal activity, fintech integration) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., deal-driven revenue, regulatory complexity) distinguishing investment banks from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Goldman Sachs, JPMorgan), focusing on deal-making and client networks. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., M&A, ESG financing) and barriers (e.g., regulation, competition).",
    "asset management": "Analyze the asset management sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact asset management fees and AUM growth. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., fee compression, market volatility, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., ESG investing, passive fund growth, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past asset management cycles (e.g., 2000s active management peak, 2010s passive surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fee pressure, market downturns) and a bull thesis (e.g., ESG demand, AUM growth) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., fee structures, client retention) distinguishing asset management from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., BlackRock, Vanguard), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., ESG, passive investing) and barriers (e.g., regulation, competition).",
    "private equity": "Analyze the private equity sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact private equity deal flow and returns. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., high leverage, economic slowdown, regulatory scrutiny) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., distressed assets, ESG investments, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past private equity cycles (e.g., 2008 distressed boom, 2010s buyout surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rising rates, deal scarcity) and a bull thesis (e.g., value creation, market recovery) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., illiquidity, leverage reliance) distinguishing private equity from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., KKR, Blackstone), focusing on deal sourcing and value creation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., ESG, buyouts) and barriers (e.g., regulation, competition).",
    "venture capital": "Analyze the venture capital sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact venture capital funding and startup valuations. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., valuation bubbles, economic downturns, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., AI startups, climate tech, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past venture capital cycles (e.g., 2000 dot-com bubble, 2010s unicorn boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., overvaluation, funding dry-up) and a bull thesis (e.g., innovation, unicorn growth) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., high risk/reward.ConcurrentModificationException: multiple threads are trying to change something at the same time, long investment horizons) distinguishing venture capital from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Sequoia, Andreessen Horowitz proxies), focusing on deal flow and exits. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., tech innovation, global startups) and barriers (e.g., regulation, competition).",
    "hedge funds": "Analyze the hedge funds sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact hedge fund strategies and returns. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., market volatility, fee pressure, regulatory scrutiny) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., quantitative trading, ESG strategies, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past hedge fund cycles (e.g., 2008 crisis alpha, 2010s quant boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fee compression, underperformance) and a bull thesis (e.g., market volatility, alpha generation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., performance fees, strategy diversity) distinguishing hedge funds from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Bridgewater proxies, Citadel proxies), focusing on strategy and talent. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., quant trading, volatility) and barriers (e.g., regulation, competition).",
    "stock exchanges": "Analyze the stock exchanges sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact trading volumes and exchange revenues. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., market volatility, regulatory changes, competition from dark pools) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., new asset classes, technology upgrades, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past exchange cycles (e.g., 2000s tech IPO boom, 2010s HFT surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., reduced trading, regulatory crackdowns) and a bull thesis (e.g., market growth, tech innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., trading volume dependency, regulatory oversight) distinguishing stock exchanges from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., ICE, Nasdaq), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., new listings, tech upgrades) and barriers (e.g., regulation, competition).",
    "payment processing": "Analyze the payment processing sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact payment processing volumes and margins. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., cybersecurity threats, regulatory changes, competition from fintech) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., digital payments, cross-border transactions, blockchain integration) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past payment cycles (e.g., 2010s mobile payment boom, 2020s crypto surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fee compression, regulatory crackdowns) and a bull thesis (e.g., e-commerce growth, digital adoption) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., transaction volume reliance, fraud prevention) distinguishing payment processing from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Visa, Mastercard), focusing on network effects and technology. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., digital wallets, global e-commerce) and barriers (e.g., regulation, competition).",
    "insurance": "Analyze the insurance sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact insurance premiums and underwriting. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., climate change losses, regulatory changes, competition) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., insurtech, emerging market growth, climate adaptation products) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past insurance cycles (e.g., 2000s catastrophe losses, 2010s tech adoption), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rising claims, low rates) and a bull thesis (e.g., premium growth, tech efficiency) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., risk modeling, regulatory capital) distinguishing insurance from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Travelers, AIG), focusing on underwriting and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., insurtech, emerging markets) and barriers (e.g., regulation, climate risks).",
    "mortgage lenders": "Analyze the mortgage lenders sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact mortgage lending volumes and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., rising rates, housing market slowdown, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., refinancing demand, digital lending, affordable housing) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past mortgage cycles (e.g., 2008 housing crash, 2010s recovery), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rate hikes, defaults) and a bull thesis (e.g., housing demand, tech efficiency) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., interest rate sensitivity, housing market dependency) distinguishing mortgage lenders from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Rocket Mortgage, PennyMac), focusing on technology and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., digital lending, housing growth) and barriers (e.g., regulation, rates).",
    "reits": "Analyze the REITs sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact REIT valuations and rental income. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., rising rates, property oversupply, economic slowdown) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., industrial REITs, data center growth, urbanization) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past REIT cycles (e.g., 2008 property crash, 2010s recovery), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rate hikes, vacancies) and a bull thesis (e.g., rental demand, diversification) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., dividend mandates, property type diversity) distinguishing REITs from other financial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Realty Income, Simon Property), focusing on portfolio quality and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., e-commerce, urbanization) and barriers (e.g., rates, oversupply).",
    "agriculture": "Analyze the agriculture sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact agricultural production and commodity prices. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., climate change, trade disputes, commodity price volatility) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., precision agriculture, sustainable practices, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past agriculture cycles (e.g., 1980s farm crisis, 2010s agtech boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., weather disruptions, oversupply) and a bull thesis (e.g., food demand, technology) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., weather dependency, commodity cycles) distinguishing agriculture from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Archer-Daniels-Midland, Mosaic), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., agtech, population growth) and barriers (e.g., climate, regulation).",
    "fishing & aquaculture": "Analyze the fishing & aquaculture sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact fishing and aquaculture demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., overfishing, climate change, regulatory restrictions) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., sustainable aquaculture, premium seafood demand, technology) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past fishing cycles (e.g., 1990s overfishing crisis, 2010s aquaculture boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., environmental regulations, supply decline) and a bull thesis (e.g., aquaculture growth, demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., ocean dependency, sustainability pressures) distinguishing fishing & aquaculture from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Mowi, AquaBounty), focusing on scale and sustainability. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., aquaculture, premium markets) and barriers (e.g., regulation, climate).",
    "palm oil industry": "Analyze the palm oil industry sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact palm oil production and demand. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., deforestation backlash, commodity price volatility, regulatory bans) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., sustainable production, biofuel demand, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past palm oil cycles (e.g., 2000s deforestation boom, 2010s sustainability shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., ESG backlash, oversupply) and a bull thesis (e.g., biofuel growth, demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., land use controversies, commodity reliance) distinguishing palm oil from other agriculture sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Sime Darby, IOI Corp), focusing on scale and sustainability. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., biofuels, sustainable practices) and barriers (e.g., regulation, ESG).",
    "corn & soybean production": "Analyze the corn & soybean production sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact corn and soybean prices and production. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., weather volatility, trade disputes, commodity price swings) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., biofuel demand, agtech adoption, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past corn/soybean cycles (e.g., 1980s farm crisis, 2010s ethanol boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, weather risks) and a bull thesis (e.g., biofuel growth, food demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., weather dependency, biofuel linkage) distinguishing corn & soybean production from other agriculture sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Archer-Daniels-Midland, Bunge), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., ethanol, global demand) and barriers (e.g., climate, trade).",
    "nickel & cobalt": "Analyze the nickel & cobalt sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact nickel and cobalt demand and pricing. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., supply chain disruptions, EV market slowdown, environmental regulations) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., EV battery demand, renewable energy storage, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past nickel/cobalt cycles (e.g., 2000s battery boom, 2010s EV surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, regulatory crackdowns) and a bull thesis (e.g., EV growth, energy transition) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., EV dependency, mining challenges) distinguishing nickel & cobalt from other commodity sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Vale, Glencore), focusing on supply and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., EV batteries, renewables) and barriers (e.g., regulation, supply).",
    "space industry": "Analyze the space industry sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact space industry investment and innovation. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., launch failures, regulatory hurdles, high costs) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., satellite broadband, space tourism, government contracts) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past space cycles (e.g., 1960s space race, 2010s private launch boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., high costs, regulatory delays) and a bull thesis (e.g., commercial space, tech breakthroughs) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., high R&D costs, government reliance) distinguishing the space industry from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., SpaceX proxies, Rocket Lab), focusing on technology and contracts. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., broadband, exploration) and barriers (e.g., costs, regulation).",
    "big box retail": "Analyze the big box retail sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact big box retail sales and margins. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., e-commerce competition, supply chain disruptions, consumer spending slowdown) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., omnichannel retail, private labels, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past retail cycles (e.g., 2000s big box boom, 2010s e-commerce shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., online retail dominance, cost pressures) and a bull thesis (e.g., physical store resilience, value offerings) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., physical footprint, supply chain scale) distinguishing big box retail from other retail sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Walmart, Costco), focusing on scale and pricing power. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., omnichannel, value demand) and barriers (e.g., e-commerce, costs).",
    "department stores": "Analyze the department stores sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact department store sales and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., e-commerce dominance, changing consumer habits, high overhead) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., experiential retail, private brands, luxury segments) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past department store cycles (e.g., 2000s decline, 2010s pivot), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., store closures, online shift) and a bull thesis (e.g., brand loyalty, adaptation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., high overhead, brand diversity) distinguishing department stores from other retail sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Nordstrom, Macy’s), focusing on brand and customer experience. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., experiential retail, luxury) and barriers (e.g., e-commerce, costs).",
    "clean energy": "Analyze the clean energy sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact clean energy investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., policy uncertainty, supply chain issues, competition from fossils) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., solar/wind growth, hydrogen adoption, energy storage) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past clean energy cycles (e.g., 2000s solar hype, 2010s wind boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., subsidy cuts, grid issues) and a bull thesis (e.g., climate goals, tech advances) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., policy reliance, intermittency) distinguishing clean energy from other energy sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Enphase, NextEra), focusing on technology and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., renewables, storage) and barriers (e.g., costs, regulation).",
    "drones": "Analyze the drone sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact drone investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory restrictions, privacy concerns, competition) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., logistics drones, defense applications, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past drone cycles (e.g., 2010s consumer boom, 2020s commercial surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulation, saturation) and a bull thesis (e.g., logistics growth, tech innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., airspace regulation, tech dependency) distinguishing drones from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., AeroVironment, Ambarella), focusing on technology and applications. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., delivery drones, defense) and barriers (e.g., regulation, costs).",
    "automotive": "Analyze the automotive sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact automotive sales and production. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., supply chain disruptions, EV transition costs, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., electric vehicles, autonomous driving, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past automotive cycles (e.g., 2008 recession, 2010s EV shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., EV costs, competition) and a bull thesis (e.g., EV adoption, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., EV transition, global supply chains) distinguishing automotive from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Toyota, Tesla), focusing on innovation and market share. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., EVs, autonomy) and barriers (e.g., regulation, costs).",
    "electric vehicles": "Analyze the electric vehicles sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact EV sales and production. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., battery supply shortages, charging infrastructure gaps, competition) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., battery tech advances, government incentives, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past EV cycles (e.g., 2010s early adoption, 2020s mainstream push), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., supply constraints, high costs) and a bull thesis (e.g., climate goals, mass adoption) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., battery dependency, infrastructure needs) distinguishing electric vehicles from other automotive sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Tesla, BYD), focusing on technology and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., battery innovation, policy) and barriers (e.g., infrastructure, costs).",
    "robotics": "Analyze the robotics sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact robotics investment and adoption. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., high R&D costs, regulatory hurdles, competition) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., industrial automation, healthcare robotics, consumer applications) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past robotics cycles (e.g., 2000s industrial boom, 2010s AI integration), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., cost barriers, slow adoption) and a bull thesis (e.g., automation demand, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., AI dependency, high capex) distinguishing robotics from other tech sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., FANUC, Intuitive Surgical), focusing on technology and applications. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., automation, healthcare) and barriers (e.g., costs, regulation).",
    "aerospace": "Analyze the aerospace sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact aerospace investment and demand. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., supply chain issues, geopolitical tensions, regulatory delays) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., commercial aviation recovery, space exploration, defense contracts) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past aerospace cycles (e.g., 2000s post-9/11 slump, 2010s boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., travel slowdown, cost overruns) and a bull thesis (e.g., defense spending, space) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., long development cycles, government contracts) distinguishing aerospace from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Boeing, Airbus), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., aviation recovery, space) and barriers (e.g., costs, regulation).",
    "defense": "Analyze the defense sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact defense spending and contracts. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., budget cuts, geopolitical stabilization, regulatory oversight) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., cybersecurity, drones, space defense) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past defense cycles (e.g., Cold War buildup, 2010s drone surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., peace dividends, budget constraints) and a bull thesis (e.g., global tensions, tech innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., government dependency, long contract cycles) distinguishing defense from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Lockheed Martin, Raytheon), focusing on contracts and technology. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., geopolitics, tech) and barriers (e.g., budget cuts, regulation).",
    "mining": "Analyze the mining sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact mining demand and commodity prices. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., environmental regulations, commodity price volatility, geopolitical risks) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., EV battery metals, green mining tech, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past mining cycles (e.g., 2000s commodity boom, 2010s slump), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, ESG backlash) and a bull thesis (e.g., EV demand, infrastructure) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., commodity reliance, environmental impact) distinguishing mining from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., BHP, Rio Tinto), focusing on scale and resource access. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., battery metals, infrastructure) and barriers (e.g., regulation, costs).",
    "steel": "Analyze the steel sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact steel demand and pricing. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., trade tariffs, overcapacity, environmental regulations) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., infrastructure spending, green steel tech, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past steel cycles (e.g., 2000s China boom, 2010s overcapacity), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, decarbonization costs) and a bull thesis (e.g., infrastructure, green steel) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., commodity cycles, energy intensity) distinguishing steel from other industrial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., ArcelorMittal, Nucor), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., infrastructure, green tech) and barriers (e.g., regulation, costs).",
    "chemicals": "Analyze the chemicals sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact chemicals demand and production costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., raw material volatility, environmental regulations, geopolitical supply issues) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., sustainable chemicals, EV materials, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past chemicals cycles (e.g., 2000s petrochemical boom, 2010s green shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., oversupply, regulatory costs) and a bull thesis (e.g., EV demand, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., raw material dependency, environmental impact) distinguishing chemicals from other industrial sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Dow, BASF), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., green chemicals, EV materials) and barriers (e.g., regulation, costs).",
    "construction": "Analyze the construction sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact construction activity and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., labor shortages, material cost volatility, interest rate hikes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., infrastructure spending, green building, urbanization) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past construction cycles (e.g., 2008 housing crash, 2010s recovery), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rate hikes, supply issues) and a bull thesis (e.g., infrastructure, urbanization) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., labor intensity, project cycles) distinguishing construction from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Vinci, Bechtel proxies), focusing on scale and expertise. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., infrastructure, green building) and barriers (e.g., costs, regulation).",
    "transportation": "Analyze the transportation sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact transportation demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., fuel price volatility, regulatory changes, supply chain disruptions) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., electrification, autonomous transport, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past transportation cycles (e.g., 2000s logistics boom, 2010s EV shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fuel costs, regulation) and a bull thesis (e.g., e-commerce growth, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., fuel dependency, infrastructure needs) distinguishing transportation from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., UPS, Tesla), focusing on scale and innovation. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., electrification, logistics) and barriers (e.g., costs, regulation).",
    "logistics": "Analyze the logistics sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact logistics demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., supply chain disruptions, fuel costs, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., e-commerce growth, automation, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past logistics cycles (e.g., 2000s globalization boom, 2010s e-commerce surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., cost pressures, disruptions) and a bull thesis (e.g., e-commerce, tech innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., supply chain complexity, tech integration) distinguishing logistics from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., FedEx, DHL proxies), focusing on scale and technology. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., e-commerce, automation) and barriers (e.g., costs, regulation).",
    "railroads": "Analyze the railroads sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact railroad freight demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., fuel costs, competition from trucking, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., infrastructure spending, intermodal growth, green rail) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past railroad cycles (e.g., 2000s freight boom, 2010s efficiency push), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., trucking competition, economic slowdown) and a bull thesis (e.g., infrastructure, e-commerce) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., fixed infrastructure, freight diversity) distinguishing railroads from other transportation sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Union Pacific, CSX), focusing on scale and network. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., intermodal, infrastructure) and barriers (e.g., costs, regulation).",
    "airlines": "Analyze the airlines sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact airline passenger demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., fuel price volatility, geopolitical tensions, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., travel recovery, sustainable aviation, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past airline cycles (e.g., 2000s post-9/11 slump, 2010s boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., fuel costs, travel slowdown) and a bull thesis (e.g., travel demand, efficiency) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., fuel dependency, high capex) distinguishing airlines from other transportation sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Delta, American Airlines), focusing on scale and loyalty programs. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., travel recovery, sustainability) and barriers (e.g., costs, regulation).",
    "shipping": "Analyze the shipping sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact shipping demand and freight rates. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., fuel costs, supply chain disruptions, environmental regulations) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., e-commerce growth, green shipping, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past shipping cycles (e.g., 2000s trade boom, 2010s overcapacity), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., overcapacity, fuel costs) and a bull thesis (e.g., trade growth, efficiency) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., freight rate volatility, port dependency) distinguishing shipping from other transportation sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Maersk, COSCO proxies), focusing on scale and efficiency. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., e-commerce, green tech) and barriers (e.g., regulation, costs).",
    "consumer goods": "Analyze the consumer goods sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact consumer goods sales and margins. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., inflation pressures, supply chain issues, shifting consumer preferences) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., sustainable products, e-commerce, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past consumer goods cycles (e.g., 2000s brand boom, 2010s e-commerce shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., cost pressures, competition) and a bull thesis (e.g., brand loyalty, demand stability) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., brand strength, consumer trends) distinguishing consumer goods from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Procter & Gamble, Unilever), focusing on brand and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., sustainability, e-commerce) and barriers (e.g., costs, competition).",
    "luxury goods": "Analyze the luxury goods sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact luxury goods sales and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., economic downturns, counterfeit goods, shifting consumer tastes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., emerging market wealth, digital sales, sustainability) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past luxury cycles (e.g., 2008 recession dip, 2010s China boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., recession risk, brand dilution) and a bull thesis (e.g., wealth growth, exclusivity) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., brand prestige, high margins) distinguishing luxury goods from other consumer sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., LVMH, Richemont), focusing on brand and market reach. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., emerging markets, digital) and barriers (e.g., economic cycles, fakes).",
    "food & beverage": "Analyze the food & beverage sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact food & beverage sales and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., supply chain issues, commodity price volatility, health trends) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., plant-based foods, e-commerce, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past food & beverage cycles (e.g., 2000s health shift, 2010s organic boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., cost pressures, competition) and a bull thesis (e.g., staples demand, innovation) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., consumer preferences, supply chain complexity) distinguishing food & beverage from other consumer sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Nestlé, PepsiCo), focusing on brand and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., health trends, e-commerce) and barriers (e.g., costs, regulation).",
    "tobacco": "Analyze the tobacco sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact tobacco sales and profitability. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory crackdowns, health trends, declining smoking rates) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., e-cigarettes, emerging markets, pricing power) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past tobacco cycles (e.g., 1990s litigation, 2010s vaping shift), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., regulation, volume decline) and a bull thesis (e.g., pricing power, vaping) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., regulatory scrutiny, addiction dynamics) distinguishing tobacco from other consumer sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Philip Morris, Altria), focusing on brand and pricing. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., e-cigarettes, emerging markets) and barriers (e.g., regulation, health trends).",
    "gaming": "Analyze the gaming sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact gaming revenue and investment. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., regulatory restrictions, market saturation, competition) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., mobile gaming, VR/AR, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past gaming cycles (e.g., 2000s console boom, 2010s mobile surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., saturation, regulation) and a bull thesis (e.g., digital growth, immersion) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., digital distribution, player engagement) distinguishing gaming from other entertainment sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Tencent, Activision Blizzard), focusing on IP and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., VR, mobile) and barriers (e.g., regulation, competition).",
    "media": "Analyze the media sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact media advertising and subscriptions. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., ad revenue declines, streaming competition, regulatory changes) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., streaming growth, digital ads, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past media cycles (e.g., 2000s cable peak, 2010s streaming boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., ad slowdown, content costs) and a bull thesis (e.g., streaming, digital shift) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., content costs, audience fragmentation) distinguishing media from other entertainment sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Disney, Netflix), focusing on content and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., streaming, digital ads) and barriers (e.g., competition, regulation).",
    "entertainment": "Analyze the entertainment sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact entertainment spending and production. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., content saturation, piracy, economic slowdown) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., streaming, immersive experiences, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past entertainment cycles (e.g., 2000s DVD peak, 2010s streaming surge), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., content costs, competition) and a bull thesis (e.g., digital growth, IP value) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., IP ownership, audience engagement) distinguishing entertainment from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Disney, Warner Bros.), focusing on content and scale. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., streaming, VR) and barriers (e.g., costs, competition).",
    "hospitality": "Analyze the hospitality sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact hospitality demand and costs. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., economic slowdown, travel restrictions, labor shortages) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., travel recovery, experiential tourism, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past hospitality cycles (e.g., 2008 recession, 2010s travel boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., travel slowdown, cost pressures) and a bull thesis (e.g., leisure demand, recovery) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., occupancy rates, labor intensity) distinguishing hospitality from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Marriott, Hilton), focusing on scale and loyalty programs. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., travel growth, experiences) and barriers (e.g., costs, regulation).",
    "tourism": "Analyze the tourism sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact tourism spending and demand. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., geopolitical tensions, climate change, economic slowdown) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., sustainable tourism, emerging markets, digital booking) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past tourism cycles (e.g., 2000s post-9/11 slump, 2010s boom), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., travel restrictions, costs) and a bull thesis (e.g., leisure demand, recovery) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., seasonality, destination dependency) distinguishing tourism from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., Booking Holdings, Expedia), focusing on scale and technology. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., emerging markets, sustainability) and barriers (e.g., costs, regulation).",
    "real estate": "Analyze the real estate sector in 2025, integrating financial data and qualitative insights, without providing actionable investment advice. Structure the response in a concise 500–700 word report with numbered sections: 1. Macroeconomic Context: Assess how GDP growth at {GDP_Growth}%, inflation at {Inflation_Rate}%, and interest rates at {Interest_Rates}% impact real estate valuations and demand. 2. Stock Performance: Present financial metrics for key players like {stockOverview}, discussing their implications for the sector’s financial health and market position. 3. Risks: Identify 3–5 risks (e.g., interest rate hikes, oversupply, economic slowdown) facing the sector through 2030. 4. Opportunities: Highlight 3–5 opportunities (e.g., urban redevelopment, affordable housing, emerging markets) driving growth, supported by industry trends. 5. Historical Similarities: Draw 2–3 parallels between 2025 and past real estate cycles (e.g., 2008 crash, 2010s recovery), contextualizing the sector’s trajectory. 6. Bear and Bull Theses: Outline a bear thesis (e.g., rate hikes, bubble risk) and a bull thesis (e.g., urbanization, demand) for the sector’s future. 7. Unique Industry Factors: Discuss 2–3 factors (e.g., location dependency, financing reliance) distinguishing real estate from other sectors. 8. Competitive Advantages: Analyze competitive strengths of 2–3 leaders (e.g., CBRE, Jones Lang LaSalle), focusing on scale and expertise. 9. Growth Potential: Assess the sector’s growth potential through 2030, identifying drivers (e.g., urbanization, infrastructure) and barriers (e.g., rates, regulation)."
  }